#ifndef 	_XML_H
#define 	_XML_H

/*----------------------------------------------------------------------------
  **  函数名称: XmlInit
  **  功能描述: 初始化XML链表
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
  **  返回结果:
  				 ==0   -- 成功
  				 !=0   -- 失败
  **  备    注:
  ---------------------------------------------------------------------------*/
int XmlInit(  );

/*----------------------------------------------------------------------------
  **  函数名称: XmlFree
  **  功能描述: 释放XML链表所占用的内存
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
  **  返回结果:
  				 ==0   -- 成功
  				 !=0   -- 失败
  **  备    注:
  ---------------------------------------------------------------------------*/
void XmlFree( );

/*----------------------------------------------------------------------------
  **  函数名称: XmlGet
  **  功能描述: 从XML链表中取出一个元素标签的值
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName -- (I), 标签名
                char * psData    -- (O), 标签值缓冲区
                int nBuffSize    -- (I), 缓冲区大小
  **  返回结果:
  				 >= 0 -- 成功, 实际标签值长度
  				 < 0  -- 失败
  **  备    注: 在向psData写入数据前, 先往psData写入nBuffSize个0x00,往psData中
                写入的数据不超过nBuffSize-1个bytes
  ---------------------------------------------------------------------------*/
int XmlGet(char * psTagName,char * psData,int nBuffSize );

/*----------------------------------------------------------------------------
  **  函数名称: XmlIntGet
  **  功能描述: 从XML链表中取出一个整数值
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName -- (I), 标签名
                int  * pnData    -- (O), 标签值缓冲区
  **  返回结果:
  				 >= 0 -- 成功, 实际标签值长度
  				 < 0  -- 失败
  **  备    注: 在向psData写入数据前, 先往psData写入nBuffSize个0x00,往psData中
                写入的数据不超过nBuffSize-1个bytes
  ---------------------------------------------------------------------------*/
int XmlIntGet(char * psTagName, int * pnData );

/*----------------------------------------------------------------------------
  **  函数名称: XmlSet
  **  功能描述: 在XML链表中写入一个元素标签的值
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName -- (I), 标签名
                char * psData    -- (I), 标签值
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlSet(char * psTagName,char * psData );

/*----------------------------------------------------------------------------
  **  函数名称: XmlCharSet
  **  功能描述: 在XML链表中写入单个字符
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName -- (I), 标签名
                char   cData     -- (I), 标签字符值
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlCharSet(char * psTagName,char cData );

/*----------------------------------------------------------------------------
  **  函数名称: XmlIntSet
  **  功能描述: 在XML链表中写入整数
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName -- (I), 标签名
                int    nData     -- (I), 整数值
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlIntSet(char * psTagName, int nData );

/*----------------------------------------------------------------------------
  **  函数名称: XmlLoadString
  **  功能描述: 将符合内部XML规范的XML字符串解析到Xml链表中
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psData -- (I), 符合内部XML规范的XML字符串
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlLoadString( char * psData );

/*----------------------------------------------------------------------------
  **  函数名称: XmlSaveString
  **  功能描述: 将内部XML链表输出到字符串中
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psData -- (O), XML字符串
                int    nSize  -- (I), XML字符串的大小
  **  返回结果:
  				 >  0  -- 成功,XML字符串的实际长度
  				 <= 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlSaveString( char * psData, int nSize );

/*----------------------------------------------------------------------------
  **  函数名称: XmlStringCmp
  **  功能描述: 元素值与传入的参数作字符串比较
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName -- (I), 标签名
                char * psData    -- (I), 标签值缓冲区
  **  返回结果:
  				 = 0 -- 元素值与传入的参数相同
  				 < 0 -- 元素值小于传入的参数或失败
  				 > 0 -- 元素值小于传入的参数
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlStringCmp(char * psTagName,char * psData );

/*----------------------------------------------------------------------------
  **  函数名称: XmlElementCmp
  **  功能描述: 比较两个元素是否相同
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psTagName1 -- (I), 标签名1
                char * psTagName2 -- (I), 标签名2
  **  返回结果:
  				 = 0 -- 元素1等于元素2
  				 < 0 -- 元素1小于元素2或失败
  				 > 0 -- 元素1大于元素2
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlElementCmp(char * psTagName1,char * psTagName2 );

/*----------------------------------------------------------------------------
  **  函数名称: XmlAddList
  **  功能描述: 在XML链表中写入一个明细元素
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psRecordSetName -- (I), 记录集标签名
                int    nRecID          -- (I), 记录序号, 从1开始
                char * psEmName        -- (I), 明细标签名
                char * psData          -- (I), 明细标签值
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlAddList( char * psRecordSetName,int nRecID,char * psEmName,char * psData);

/*----------------------------------------------------------------------------
  **  函数名称: XmlAddIntList
  **  功能描述: 在XML链表中写入一个整数值的明细元素
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psRecordSetName -- (I), 记录集标签名
                int    nRecID          -- (I), 记录序号, 从1开始
                char * psEmName        -- (I), 明细标签名
                char * psData          -- (I), 明细标签值
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlAddIntList( char * psRecordSetName,int nRecID,char * psEmName,int nData);

/*----------------------------------------------------------------------------
  **  函数名称: XmlFetchList
  **  功能描述: 从XML链表中一个明细元素的属性值
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                char * psRecordSetName -- (I), 记录集标签名
                int    nRecID          -- (I), 记录序号, 从1开始
                char * psEmName        -- (I), 明细标签名
                char * psData          -- (I), 明细标签值
                int nBuffSize          -- (I), 缓冲区大小
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 
  ---------------------------------------------------------------------------*/
int XmlFetchList( char * psRecordSetName,int nRecID,char * psEmName,char * psData,int nBuffSize);

/*----------------------------------------------------------------------------
  **  函数名称: XmlShow
  **  功能描述: 显示XML链表内容
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
                FILE * fp -- (I), 文件流
  **  返回结果:
  				 == 0 -- 成功
  				 < 0  -- 失败
  **  备    注: 业务程序中使用WriteXml()来记录内部XML的内容,不宜直接使用此函数
  ---------------------------------------------------------------------------*/
int XmlShow( FILE * fp );

/*----------------------------------------------------------------------------
  **  函数名称: XmlError
  **  功能描述: 取出Xml函数的出错信息
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
  **  返回结果:
  				 Xml函数的出错信息
  **  备    注:
  ---------------------------------------------------------------------------*/
char * XmlError();

/*----------------------------------------------------------------------------
  **  函数名称: XmlPointer
  **  功能描述: 取出内部Xml链表的头指针
  **  作    者: 
  **  编写日期:
  **  修    改:	
  **  修改日期:
  **  参    数: 
  **  返回结果:
  				 Xml链表的头指针
  **  备    注:
  ---------------------------------------------------------------------------*/
void * XmlPointer();

#endif
